nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/driver_examples/cadc/parallel_independent_conversion/pin_mux.c
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MC56F80748
package_id: MC56F80748VLH
mcu_data: ksdk2_0
processor_version: 0.12.7
board: MC56F80000-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '7', peripheral: QSCI0, signal: RXD, pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1}
  - {pin_num: '5', peripheral: QSCI0, signal: TXD, pin_signal: GPIOC2/TXD0/XB_OUT11/XB_IN2/CLKO0}
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
  - {pin_num: '10', peripheral: ADC, signal: 'ANA, 6', pin_signal: GPIOA6/ANA6/OPAMPA_IN1/CMPC_IN4}
  - {pin_num: '9', peripheral: ADC, signal: 'ANA, 7', pin_signal: GPIOA7/ANA7/OPAMPA_IN2}
  - {pin_num: '12', peripheral: ADC, signal: 'ANA, 40', pin_signal: GPIOA4/ANA40/CMPA_IN4}
  - {pin_num: '11', peripheral: ADC, signal: 'ANA, 5', pin_signal: GPIOA5/ANA5/CMPB_IN4}
  - {pin_num: '27', peripheral: ADC, signal: 'ANB, 2', pin_signal: GPIOB2/ANB2/VREFHB/CMPC_IN3}
  - {pin_num: '28', peripheral: ADC, signal: 'ANB, 3', pin_signal: GPIOB3/ANB3/VREFLB/CMPC_IN0}
  - {pin_num: '21', peripheral: ADC, signal: 'ANB, 40', pin_signal: GPIOB4/ANB40/CMPC_IN1}
  - {pin_num: '20', peripheral: ADC, signal: 'ANB, 5', pin_signal: GPIOB5/ANB5/CMPC_IN2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOA4 (pin 12) */
    GPIO_PinSetPeripheralMode(BOARD_ANA4_GPIO, BOARD_ANA4_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA5 (pin 11) */
    GPIO_PinSetPeripheralMode(BOARD_ANA5_GPIO, BOARD_ANA5_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA6 (pin 10) */
    GPIO_PinSetPeripheralMode(BOARD_THER_A_GPIO, BOARD_THER_A_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA7 (pin 9) */
    GPIO_PinSetPeripheralMode(BOARD_THER_B_GPIO, BOARD_THER_B_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB2 (pin 27) */
    GPIO_PinSetPeripheralMode(BOARD_CUR_DCB_GPIO, BOARD_CUR_DCB_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB3 (pin 28) */
    GPIO_PinSetPeripheralMode(BOARD_CUR_C_GPIO, BOARD_CUR_C_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB4 (pin 21) */
    GPIO_PinSetPeripheralMode(BOARD_ANB4_GPIO, BOARD_ANB4_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB5 (pin 20) */
    GPIO_PinSetPeripheralMode(BOARD_ANB5_GPIO, BOARD_ANB5_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_EXTAL_GPIO, BOARD_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_TXD0_GPIO, BOARD_Boot_TXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C2_TXD0);
    /* Enable peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_RXD0_GPIO, BOARD_Boot_RXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C3_RXD0);

    /* Internal Peripheral Select */
    /* Select SCI0_RXD Input.: Select SCI0_RXD Input, GPIOC3 or GPIOC8 or GPIOF8. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI0_RXDInputIndex, kSIM_SCI0_RXDInput_GPIOC3_GPIOC8_GPIOF8);

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
